# res = {"result": ["کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر",
#             "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر",
#             "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر",
#             "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر",
#             "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر",
#             "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر",
#             "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر", "کیر","کیر"]}
#
#
# for i,j in enumerate(res['result']):
#     print(i,j)


level = input('enter the level')
level = int(level)

mabna = input('enter the mabna')

mabna = int(mabna)

sum = 0

for i in range(level+1):
    sum = sum + (mabna ** i)


last_step = mabna ** level

print(last_step/sum)
print('sum',sum)
print('last_step',last_step)